tap "homebrew/services"
tap "oven-sh/bun"
brew "azure-cli"
brew "bat"
brew "caddy"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "dnsmasq"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gh"
brew "glow"
brew "httpie", link: false
brew "just"
brew "lazygit"
brew "libffi"
brew "lsd"
brew "make"
brew "neovim"
brew "node"
brew "nvm"
brew "ollama"
brew "openjdk"
brew "pkgconf"
brew "postgresql@16"
brew "pyenv"
brew "python-tk@3.10"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "tcl-tk"
brew "tmux"
brew "tree"
brew "uv"
brew "zoxide"
brew "oven-sh/bun/bun"
cask "alt-tab"
cask "anki"
cask "arc"
cask "automattic-texts"
cask "brave-browser"
cask "cursor"
cask "datagrip"
cask "discord"
cask "figma"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "ghostty"
cask "gitkraken"
cask "http-toolkit"
cask "httpie-desktop"
cask "linear-linear"
cask "ngrok"
cask "nordvpn"
cask "obsidian"
cask "orbstack"
cask "pictogram"
cask "polypane"
cask "postman"
cask "raycast"
cask "spotify"
cask "visual-studio-code"
cask "zed"
vscode "aaron-bond.better-comments"
vscode "adrianwilczynski.toggle-hidden"
vscode "beardedbear.beardedtheme"
vscode "bradlc.vscode-tailwindcss"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "charliermarsh.ruff"
vscode "chenjie.fleet-dark"
vscode "dangmai.workspace-default-settings"
vscode "dbaeumer.vscode-eslint"
vscode "deinsoftware.vitest-snippets"
vscode "docsmsft.docs-markdown"
vscode "docsmsft.docs-preview"
vscode "dotenv.dotenv-vscode"
vscode "drcika.apc-extension"
vscode "editorconfig.editorconfig"
vscode "edwardchen1993.anysphere-dark-theme"
vscode "eliostruyf.vscode-typescript-exportallmodules"
vscode "esbenp.prettier-vscode"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "etmoffat.pip-packages"
vscode "exodiusstudios.comment-anchors"
vscode "franzgollhammer.jb-fleet-dark"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hbenl.vscode-mocha-test-adapter"
vscode "hbenl.vscode-test-explorer"
vscode "hoovercj.vscode-settings-cycler"
vscode "icrawl.discord-vscode"
vscode "igorsbitnev.error-gutters"
vscode "johnygeorges.jetjet-theme"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "midnightsyntax.vscode-wrap-console-log"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "reactreedev.reactree"
vscode "robbowen.synthwave-vscode"
vscode "rvest.vs-code-prettier-eslint"
vscode "skyran.js-jsx-snippets"
vscode "sonarsource.sonarlint-vscode"
vscode "stivo.tailwind-fold"
vscode "tal7aouy.rainbow-bracket"
vscode "teabyii.ayu"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vulfpeck.jetbrains-fleet-theme"
vscode "wallabyjs.quokka-vscode"
vscode "whizkydee.material-palenight-theme"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
